// america
final Map<String, dynamic> americanLotteryInfo = {
  "title": "파워볼 정보",
  "highestPrize": "최고 당첨금: ﹩2,040,000,000",
  "frequency": "추첨 빈도: 매주",
  "ticketPrice": "티켓 가격: ﹩2",
  "drawDate": "추첨일: 수요일과 토요일",
  "purchasableArea": "미국 전역 및 온라인 일부 지역",
  "prizeDetails": [
    "역대 최고 당첨금: ﹩2,040,000,000",
    "1등 상금: ﹩150,000,000",
    "2등 상금: ﹩1,000,000",
    "3등 상금: ﹩50,000",
    "4등 상금: ﹩100",
    "5등 상금: ﹩100",
    "6등 상금: ﹩7",
    "7등 상금: ﹩7",
    "8등 상금: ﹩4",
    "9등 상금: ﹩4",
  ],
  "winningMethods": [
    "1등: 5개 숫자 + 파워볼",
    "2등: 5개 숫자",
    "3등: 4개 숫자 + 파워볼",
    "4등: 4개 숫자",
    "5등: 3개 숫자 + 파워볼",
    "6등: 3개 숫자",
    "7등: 2개 숫자 + 파워볼",
    "8등: 1개 숫자 + 파워볼",
    "9등: 파워볼",
  ],
  "probabilities": [
    "1등 당첨 확률: 1 / 292,201,338",
    "2등 당첨 확률: 1 / 11,688,053",
    "3등 당첨 확률: 1 / 913,129",
    "4등 당첨 확률: 1 / 36,525",
    "5등 당첨 확률: 1 / 14,494",
    "6등 당첨 확률: 1 / 579",
    "7등 당첨 확률: 1 / 701",
    "8등 당첨 확률: 1 / 92",
    "9등 당첨 확률: 1 / 38",
  ],

};

final List<String> americanLotteryMethods = [
  "1. 지정된 판매점에서 복권 티켓을 구매합니다.",
  "2. 1부터 69까지의 숫자 중 5개와 1부터 26까지의 파워볼 번호를 선택합니다.",
  "3. 추첨은 매주 수요일과 토요일 밤에 이루어집니다.",
  "4. 5개의 당첨 번호와 파워볼 번호가 추첨됩니다.",
  "5. 최소 1개의 숫자와 파워볼 번호를 맞추면 상금을 받을 수 있습니다.",
  "6. 모든 5개의 숫자와 파워볼 번호를 맞추면 잭팟에 당첨됩니다.",
  "7. 추가 옵션인 Power Play를 통해 상금을 증가시킬 수 있습니다.",
];

final Map<String, dynamic> megaMillionsInfo = {
  "title": "메가 밀리언 정보",
  "highestPrize": "최고 당첨금: ﹩1,602,000,000",
  "frequency": "추첨 빈도: 매주",
  "ticketPrice": "티켓 가격: ﹩2",
  "drawDate": "추첨일: 화요일과 금요일",
  "purchasableArea": "미국 전역 및 온라인 일부 지역",
  "prizeDetails": [
    "역대 최고 당첨금: ﹩1,602,000,000",
    "1등 상금: ﹩100,000,000",
    "2등 상금: ﹩1,000,000",
    "3등 상금: ﹩10,000",
    "4등 상금: ﹩500",
    "5등 상금: ﹩200",
    "6등 상금: ﹩10",
    "7등 상금: ﹩10",
    "8등 상금: ﹩4",
    "9등 상금: ﹩2",
  ],
  "winningMethods": [
    "1등: 5개 숫자 + 메가볼",
    "2등: 5개 숫자",
    "3등: 4개 숫자 + 메가볼",
    "4등: 4개 숫자",
    "5등: 3개 숫자 + 메가볼",
    "6등: 3개 숫자",
    "7등: 2개 숫자 + 메가볼",
    "8등: 1개 숫자 + 메가볼",
    "9등: 메가볼",
  ],
  "probabilities": [
    "1등 당첨 확률: 1 / 302,575,350",
    "2등 당첨 확률: 1 / 12,607,306",
    "3등 당첨 확률: 1 / 931,001",
    "4등 당첨 확률: 1 / 38,792",
    "5등 당첨 확률: 1 / 14,547",
    "6등 당첨 확률: 1 / 606",
    "7등 당첨 확률: 1 / 693",
    "8등 당첨 확률: 1 / 89",
    "9등 당첨 확률: 1 / 37",
  ],
};

final List<String> megaMillionsMethods = [
  "1. 지정된 판매점에서 메가 밀리언 티켓을 구매합니다.",
  "2. 1부터 70까지의 숫자 중 5개와 1부터 25까지의 메가볼 번호를 선택합니다.",
  "3. 추첨은 매주 화요일과 금요일 밤에 이루어집니다.",
  "4. 5개의 당첨 번호와 메가볼 번호가 추첨됩니다.",
  "5. 최소 1개의 숫자와 메가볼 번호를 맞추면 상금을 받을 수 있습니다.",
  "6. 모든 5개의 숫자와 메가볼 번호를 맞추면 잭팟에 당첨됩니다.",
  "7. 추가 옵션인 Megaplier를 통해 상금을 증가시킬 수 있습니다.",
];



// lorea
final Map<String, dynamic> koreanLotteryInfo = {
  "title": "로또 6/45 정보",
  "highestPrize": "최고 당첨금: ₩40,700,000,00",
  "frequency": "추첨 빈도: 주간",
  "ticketPrice": "티켓 가격: ₩1,000",
  "drawDate": "추첨일: 토요일",
  "purchasableArea": "대한민국 전역",
  "prizeDetails": [
    "역대 최고 당첨금: ₩40,700,000,00",
    "1등 상금: ₩2,000,000,000",
    "2등 상금: ₩60,000,000",
    "3등 상금: ₩1,500,000",
    "4등 상금: ₩50,000",
    "5등 상금: ₩5,000",
  ],
  "winningMethods": [
    "1등: 6개 숫자",
    "2등: 5개 숫자 + 보너스",
    "3등: 5개 숫자",
    "4등: 4개 숫자",
    "5등: 3개 숫자",
  ],
  "probabilities": [
    "1등 당첨 확률: 1 / 8,145,060",
    "2등 당첨 확률: 1 / 1,357,510",
    "3등 당첨 확률: 1 / 35,724",
    "4등 당첨 확률: 1 / 733",
    "5등 당첨 확률: 1 / 45",
  ],
};

final List<String> koreanLotteryMethods = [
  "1. 지정된 판매점에서 로또 티켓을 구매합니다.",
  "2. 1부터 45까지의 숫자 중 6개를 선택합니다.",
  "3. 추첨은 매주 토요일 밤에 이루어집니다.",
  "4. 6개의 당첨 번호와 보너스 번호가 추첨됩니다.",
  "5. 최소 3개의 숫자를 맞추면 상금을 받을 수 있습니다.",
  "6. 모든 6개의 숫자를 맞추면 잭팟에 당첨됩니다.",
  "7. 보너스 번호는 5개의 숫자를 맞춘 경우 상금을 증가시킵니다.",
];



// japan
final Map<String, dynamic> japaneseLottery6Info = {
  "title": "로또 6 정보",
  "highestPrize": "최고 당첨금: ¥600,000,000",
  "frequency": "추첨 빈도: 매주",
  "ticketPrice": "티켓 가격: ¥200",
  "drawDate": "추첨일: 목요일",
  "purchasableArea": "일본 전역",
  "prizeDetails": [
    "역대 최고 당첨금: ¥600,000,000",
    "1등 상금: ¥200,000,000",
    "2등 상금: ¥10,000,000",
    "3등 상금: ¥500,000",
    "4등 상금: ¥10,000",
    "5등 상금: ¥1,000",
  ],
  "winningMethods": [
    "1등: 6개 숫자",
    "2등: 5개 숫자 + 보너스",
    "3등: 5개 숫자",
    "4등: 4개 숫자",
    "5등: 3개 숫자",
  ],
  "probabilities": [
    "1등 당첨 확률: 1 / 6,096,454",
    "2등 당첨 확률: 1 / 1,016,076",
    "3등 당첨 확률: 1 / 28,224",
    "4등 당첨 확률: 1 / 610",
    "5등 당첨 확률: 1 / 39",
  ],
};

final List<String> japaneseLottery6Methods = [
  "1. 지정된 판매점에서 로또 티켓을 구매합니다.",
  "2. 1부터 43까지의 숫자 중 6개를 선택합니다.",
  "3. 추첨은 매주 목요일 밤에 이루어집니다.",
  "4. 6개의 당첨 번호와 보너스 번호가 추첨됩니다.",
  "5. 최소 3개의 숫자를 맞추면 상금을 받을 수 있습니다.",
  "6. 모든 6개의 숫자를 맞추면 잭팟에 당첨됩니다.",
  "7. 보너스 번호는 5개의 숫자를 맞춘 경우 상금을 증가시킵니다.",
];

final Map<String, dynamic> japaneseLottery7Info = {
  "title": "로또 7 정보",
  "highestPrize": "최고 당첨금: ¥1,000,000,000",
  "frequency": "추첨 빈도: 매주",
  "ticketPrice": "티켓 가격: ¥300",
  "drawDate": "추첨일: 금요일",
  "purchasableArea": "일본 전역",
  "prizeDetails": [
    "역대 최고 당첨금: ¥1,000,000,000",
    "1등 상금: ¥300,000,000",
    "2등 상금: ¥15,000,000",
    "3등 상금: ¥1,000,000",
    "4등 상금: ¥50,000",
    "5등 상금: ¥10,000",
    "6등 상금: ¥3,000",
  ],
  "winningMethods": [
    "1등: 7개 숫자",
    "2등: 6개 숫자 + 보너스",
    "3등: 6개 숫자",
    "4등: 5개 숫자",
    "5등: 개 숫자",
    "6등: 3개 숫자 + 보너스",
  ],
  "probabilities": [
    "1등 당첨 확률: 1 / 10,295,472",
    "2등 당첨 확률: 1 / 735,391",
    "3등 당첨 확률: 1 / 52,528",
    "4등 당첨 확률: 1 / 1,127",
    "5등 당첨 확률: 1 / 72",
    "6등 당첨 확률: 1 / 42",
  ],
};

final List<String> japaneseLottery7Methods = [
  "1. 지정된 판매점에서 로또 티켓을 구매합니다.",
  "2. 1부터 37까지의 숫자 중 7개를 선택합니다.",
  "3. 추첨은 매주 금요일 밤에 이루어집니다.",
  "4. 7개의 당첨 번호와 2개의 보너스 번호가 추첨됩니다.",
  "5. 최소 3개의 숫자를 맞추면 상금을 받을 수 있습니다.",
  "6. 모든 7개의 숫자를 맞추면 잭팟에 당첨됩니다.",
  "7. 보너스 번호는 6개의 숫자를 맞춘 경우 상금을 증가시킵니다.",
];



// spain
final Map<String, dynamic> spanishLaPrimitivaInfo = {
  "title": "La Primitiva 정보",
  "highestPrize": "최고 당첨금: €101,700,000",
  "frequency": "추첨 빈도: 주간",
  "ticketPrice": "티켓 가격: €1.50",
  "drawDate": "추첨일: 목요일과 토요일",
  "purchasableArea": "스페인 및 선택된 온라인 플랫폼",
  "prizeDetails": [
    "역대 최고 당첨금: €101,700,000",
    "잭팟: €3,000,000부터 시작",
    "2등 상금: €1,000,000",
    "3등 상금: €50,000",
    "4등 상금: €100",
    "5등 상금: €100",
    "6등 상금: €7",
    "Reintegro: €1 (티켓 환불)"
  ],
  "winningMethods": [
    "잭팟: 6개 숫자 + Reintegro",
    "2등: 6개 숫자",
    "3등: 5개 숫자 + 보너스(Complimentary)",
    "4등: 5개 숫자",
    "5등: 4개 숫자",
    "6등: 3개 숫자",
    "Reintegro: Reintegro 번호 일치"
  ],
  "probabilities": [
    "잭팟: 1 / 139,838,160",
    "2등 당첨 확률: 1 / 13,983,816",
    "3등 당첨 확률: 1 / 2,330,636",
    "4등 당첨 확률: 1 / 54,201",
    "5등 당첨 확률: 1 / 1,032",
    "6등 당첨 확률: 1 / 57",
    "Reintegro 당첨 확률: 1 / 10"
  ],
};

final List<String> spanishLaPrimitivaMethods = [
  "1. 지정된 판매점에서 La Primitiva 티켓을 구매합니다.",
  "2. 1부터 49까지의 숫자 중 6개와 0부터 9까지의 Reintegro 번호를 선택합니다.",
  "3. 추첨은 매주 목요일과 토요일 밤에 이루어집니다.",
  "4. 6개의 당첨 번호와 Reintegro 번호, 그리고 Complimentary 번호가 추첨됩니다.",
  "5. 최소 3개의 숫자와 Reintegro 번호를 맞추면 상금을 받을 수 있습니다.",
  "6. 모든 6개의 숫자와 Reintegro 번호를 맞추면 잭팟에 당첨됩니다.",
  "7. Joker 게임을 추가로 선택하여 더 큰 상금을 노릴 수 있습니다."
  "8. Joker를 선택하려면 €1를 추가로 지불해야 합니다."
];

final Map<String, dynamic> elGordoLotteryInfo = {
  "title": "El Gordo 정보",
  "highestPrize": "최고 당첨금: €22,000,000",
  "frequency": "추첨 빈도: 주간",
  "ticketPrice": "티켓 가격: €1.50",
  "drawDate": "추첨일: 일요일 오후 1시 30분",
  "purchasableArea": "스페인 및 선택된 온라인 플랫폼",
  "prizeDetails": [
    "역대 최고 당첨금: €22,000,000",
    "잭팟 상금: €5,000,000부터 시작",
    "2등 상금: 평균 €1,000,000",
    "3등 상금: 평균 €50,000",
    "4등 상금: 평균 €1,000",
    "5등 상금: 평균 €100",
    "6등 상금: 평균 €10",
    "7등 상금: 평균 €5",
    "8등 상금: €3",
    "9등 상금: €1.5",
  ],
  "winningMethods": [
    "잭팟: 5개 숫자 + 클라베",
    "2등: 5개 숫자",
    "3등: 4개 숫자 + 클라베",
    "4등: 4개 숫자",
    "5등: 3개 숫자 + 클라베",
    "6등: 3개 숫자",
    "7등: 2개 숫자 + 클라베",
    "8등: 2개 숫자",
    "9등: 클라베 번호만 맞춤",
  ],
  "probabilities": [
    "잭팟 당첨 확률: 1 / 31,625,100",
    "2등 당첨 확률: 1 / 3,513,900",
    "3등 당첨 확률: 1 / 129,082",
    "4등 당첨 확률: 1 / 14,342",
    "5등 당첨 확률: 1 / 2,689",
    "6등 당첨 확률: 1 / 299",
    "7등 당첨 확률: 1 / 172",
    "8등 당첨 확률: 1 / 19",
    "9등 당첨 확률: 1 / 10",
  ],
};

final List<String> elGordoLotteryMethods = [
  "1. 지정된 판매점에서 El Gordo 티켓을 구매합니다.",
  "2. 1부터 54까지의 숫자 중 5개와 0부터 9까지의 클라베 번호를 선택합니다.",
  "3. 추첨은 매주 일요일 스페인 현지 시간으로 오후 1시 30분에 이루어집니다.",
  "4. 추첨 시 5개의 당첨 번호와 클라베 번호가 결정됩니다.",
  "5. 최소 클라베 번호를 맞추어도 소액의 상금을 받을 수 있습니다.",
  "6. 상금을 받기 위한 최소 조건은 클라베 번호 또는 2개의 숫자를 맞추는 것입니다.",
  "7. 모든 5개의 숫자와 클라베 번호를 맞추면 잭팟에 당첨됩니다.",
];



// euro
final Map<String, dynamic> euroMillionsInfo = {
  "title": "유로밀리언 정보",
  "highestPrize": "최고 당첨금: €240,000,000",
  "frequency": "추첨 빈도: 주 2회",
  "ticketPrice": "티켓 가격: €2.50",
  "drawDate": "추첨일: 화요일과 금요일",
  "purchasableArea": "영국.스페인.포르투갈.프랑스.오스트리아.스위스.벨기에.룩셈부룩.아일랜드",
  "prizeDetails": [
    "역대 최고 당첨금: €240,000,000",
    "잭팟: €17,000,000부터 시작",
    "2등 상금: 평균 €500,000",
    "3등 상금: 평균 €50,000",
    "4등 상금: 평균 €4,000",
    "5등 상금: 평균 €200",
    "6등 상금: 평균 €100",
    "7등 상금: 평균 €50",
    "8등 상금: 평균 €20",
    "9등 상금: 평균 €15",
    "10등 상금: 평균 €10",
    "11등 상금: 평균 €10",
    "12등 상금: 평균 €7",
    "13등 상금: 평균 €4",
  ],
  "winningMethods": [
    "잭팟: 5개 숫자 + 2개 Lucky Star 번호",
    "2등: 5개 숫자 + 1개 Lucky Star 번호",
    "3등: 5개 숫자",
    "4등: 4개 숫자 + 2개 Lucky Star 번호",
    "5등: 4개 숫자 + 1개 Lucky Star 번호",
    "6등: 3개 숫자 + 2개 Lucky Star 번호",
    "7등: 4개 숫자",
    "8등: 2개 숫자 + 2개 Lucky Star 번호",
    "9등: 3개 숫자 + 1개 Lucky Star 번호",
    "10등: 3개 숫자",
    "11등: 1개 숫자 + 2개 Lucky Star 번호",
    "12등: 2개 숫자 + 1개 Lucky Star 번호",
    "13등: 2개 숫자",
  ],
  "probabilities": [
    "잭팟 당첨 확률: 1 / 139,838,160",
    "2등 당첨 확률: 1 / 6,991,908",
    "3등 당첨 확률: 1 / 3,107,515",
    "4등 당첨 확률: 1 / 621,503",
    "5등 당첨 확률: 1 / 31,076",
    "6등 당첨 확률: 1 / 14,126",
    "7등 당첨 확률: 1 / 13,812",
    "8등 당첨 확률: 1 / 986",
    "9등 당첨 확률: 1 / 707",
    "10등 당첨 확률: 1 / 314",
    "11등 당첨 확률: 1 / 188",
    "12등 당첨 확률: 1 / 50",
    "13등 당첨 확률: 1 / 22",
  ],
};

final List<String> euroMillionsMethods = [
  "1. 지정된 판매점에서 EuroMillions 티켓을 구매합니다.",
  "2. 1부터 50까지의 숫자 중 5개와 1부터 12까지의 Lucky Star 번호 중 2개를 선택합니다.",
  "3. 추첨은 매주 화요일과 금요일에 이루어집니다.",
  "4. 5개의 주요 당첨 번호와 2개의 Lucky Star 번호가 결정됩니다.",
  "5. 최소 2개의 주요 당첨 번호 또는 1개의 주요 당첨 번호와 2개의 Lucky Star 번호를 맞추면 상금을 받을 수 있습니다.",
  "6. 모든 5개의 주요 당첨 번호와 2개의 Lucky Star 번호를 맞추면 최고 상금인 잭팟에 당첨됩니다."
];



// Australia
final Map<String, dynamic> australiaPowerballInfo = {
  "title": "호주 파워볼 정보",
  "highestPrize": "최고 당첨금: A﹩200,000,000",
  "frequency": "추첨 빈도: 주 1회",
  "ticketPrice": "티켓 가격: A﹩1.20",
  "drawDate": "추첨일: 목요일",
  "purchasableArea": "호주 전역",
  "prizeDetails": [
    "역대 최고 당첨금: A﹩200,000,000",
    "잭팟: A﹩3,000,000부터 시작",
    "2등 상금: 평균 A﹩67,000",
    "3등 상금: 평균 A﹩4,000",
    "4등 상금: 평균 A﹩400",
    "5등 상금: 평균 A﹩58",
    "6등 상금: 평균 A﹩20",
    "7등 상금: 평균 A﹩13",
    "8등 상금: 평균 A﹩10",
  ],
  "winningMethods": [
    "잭팟: 7개 숫자 + 파워볼",
    "2등: 7개 숫자",
    "3등: 6개 숫자 + 파워볼",
    "4등: 6개 숫자",
    "5등: 5개 숫자 + 파워볼",
    "6등: 5개 숫자",
    "7등: 4개 숫자 + 파워볼",
    "8등: 3개 숫자 + 파워볼",
  ],
  "probabilities": [
    "잭팟 당첨 확률: 1 / 134,490,400",
    "2등 당첨 확률: 1 / 7,078,442",
    "3등 당첨 확률: 1 / 686,176",
    "4등 당첨 확률: 1 / 36,115",
    "5등 당첨 확률: 1 / 16,943",
    "6등 당첨 확률: 1 / 1,173",
    "7등 당첨 확률: 1 / 892",
    "8등 당첨 확률: 1 / 188",
  ],
};

final List<String> australiaPowerballMethods = [
  "1. 지정된 판매점에서 호주 파워볼 티켓을 구매합니다.",
  "2. 1부터 35까지의 숫자 중 7개와 1부터 20까지의 파워볼 번호를 선택합니다.",
  "3. 추첨은 매주 목요일에 이루어집니다.",
  "4. 7개의 당첨 번호와 파워볼 번호가 결정됩니다.",
  "5. 최소 3개의 숫자와 파워볼 번호를 맞추면 상금을 받을 수 있습니다.",
  "6. 모든 7개의 숫자와 파워볼 번호를 맞추면 최고 상금인 잭팟에 당첨됩니다."
];
